In [1]:
import matplotlib.pyplot as plt
% matplotlib inline
import numpy as np
import pandas as pd

In [2]:
df_hour_event = pd.read_csv('events_hour.csv')

In [3]:
df_hour_event.shape

(404, 11)

In [4]:
df_hour_event.columns

Index(['bearing', 'delay', 'event_timestamp', 'lastLocID', 'lastStopSeq',
       'nextLocID', 'nextStopSeq', 'tripID', 'vehicle_id',
       'vehicle_location_latitude', 'vehicle_location_longitude'],
      dtype='object')

In [5]:
df_hour_event.head()

,bearing,delay,event_timestamp,lastLocID,lastStopSeq,nextLocID,nextStopSeq,tripID,vehicle_id,vehicle_location_latitude,vehicle_location_longitude
0,90,-36,2017-01-31 07:00:08,8351,39,8352,40,7127546,229,45.522065,-122.484751
1,201,-16,2017-01-31 07:00:17,7608,21,7618,22,7129572,203,45.511537,-122.681494
2,270,-28,2017-01-31 07:00:33,8366,9,8367,10,7127666,106,45.522295,-122.507952
3,17,-43,2017-01-31 07:00:44,13133,2,13134,3,7129573,322,45.467694,-122.566654
4,306,-162,2017-01-31 07:00:44,11508,8,11509,9,7128218,122,45.539746,-122.675803

In [6]:
df_locations = df_hour_event.loc[:, 'vehicle_location_latitude':'vehicle_location_longitude']

In [7]:
df_locations.head()

   vehicle_location_latitude  vehicle_location_longitude
0                  45.522065                 -122.484751
1                  45.511537                 -122.681494
2                  45.522295                 -122.507952
3                  45.467694                 -122.566654
4                  45.539746                 -122.675803

In [8]:
df_locaitons_np = np.array(df_locations)

In [9]:
import gmaps
import gmaps.datasets
gmaps.configure(api_key="AIzaSyC9ZIZBEjaoHk2oeQ19_PpwSzuOt7hf2qY")

In [13]:
fig = gmaps.figure()
fig.add_layer(gmaps.heatmap_layer(df_locations))
fig

A Jupyter Widget

In [12]:
gmaps.geometry.computeDistanceBetween(df_locations_np[1], df_locations_np[2])

AttributeError: module 'gmaps' has no attribute 'geometry'

In [48]:
df_hour_trip = pd.read_csv('trips_hour.csv')

In [32]:
df_hour_trip.shape

(82, 7)

In [33]:
df_hour_trip.columns

Index(['tripID', 'vehicle_id', 'blockID', 'direction', 'garage', 'messageCode',
       'routeNumber'],
      dtype='object')

In [41]:
df_hour_trip.head()

    tripID  vehicle_id  blockID  direction garage  messageCode  routeNumber
0  7126593         240     9049          0   ELMO          927           90
1  7126593         312     9049          0   ELMO          927           90
2  7126654         209     9043          1   ELMO          929           90
3  7126654         242     9043          1   ELMO          929           90
4  7126655         222     9047          1   ELMO          929           90

In [ ]:
df_hour_trip

In [39]:
import gmaps
import gmaps.datasets
gmaps.configure(api_key="AIzaSyC9ZIZBEjaoHk2oeQ19_PpwSzuOt7hf2qY")

In [40]:
df_message = pd.read_csv('message_codes.csv')

In [10]:
df_message.shape

(45, 2)

In [22]:
df_message.columns

Index(['messageCode', 'signMessageLong'], dtype='object')

In [11]:
df_message.head()

   messageCode                              signMessageLong
0            0                                          NaN
1          451  MAX  Blue Line to City Center and Hillsboro
2          452                        MAX  Blue Line to PSU
3          453                         MAX  Red Line to PSU
4          454    MAX  to Gresham - MAX to Portland Airport

In [13]:
df_monthly_performance = pd.read_excel('monthly-performance.xlsx')

In [15]:
df_monthly_performance.shape

(130, 22)

In [17]:
df_monthly_performance.head()

,TriMet Performance Dashboard Monthly Data,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21
0,NaN,WEEKLY BOARDING RIDES,NaN,NaN,NaN,OPERATING COSTS PER BOARDING RIDE,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,TAX REVENUE,NaN,PASSENGER REVENUE,NaN,COLLISION RATE,NaN,COLLISION
1,Date,BUS,MAX,LIFT/CAB,WES,BUS All,BUS Local,BUS Frequent,MAX,LIFT/CAB,...,MAX,LIFT,WES,Actual,Budget,Actual,Budget,"BUS/100,000","MAX/100,000",WES
2,2008-07-01 00:00:00,1306900,784700,21951,NaN,2.60824,3.24,2.12,1.40068,28.2986,...,0.87,0.924,NaN,17619064,18003462,7272264,6934341,NaN,NaN,NaN
3,2008-08-01 00:00:00,1308800,633100,21632,NaN,2.47407,3.13,1.95,1.75058,30.3154,...,0.867,0.919,NaN,17619064,18003462,7147562,7048905,NaN,NaN,NaN
4,2008-09-01 00:00:00,1328900,702300,21744,NaN,2.64937,3.29,2.15,1.63033,27.4816,...,0.862,0.911,NaN,1.61227e+07,18003462,7725953,7267971,NaN,NaN,NaN

In [19]:
df_monthly_performance.columns

Index(['TriMet Performance Dashboard Monthly Data', 'Unnamed: 1', 'Unnamed: 2',
       'Unnamed: 3', 'Unnamed: 4', 'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7',
       'Unnamed: 8', 'Unnamed: 9', 'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12',
       'Unnamed: 13', 'Unnamed: 14', 'Unnamed: 15', 'Unnamed: 16',
       'Unnamed: 17', 'Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20',
       'Unnamed: 21'],
      dtype='object')